Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F16KM104.h
#define _IEC1_INT1IE_POSITION                    0x00000004
#define _IEC1_INT1IE_MASK                        0x00000010
#define _IEC1_INT1IE_LENGTH                      0x00000001

#define _IEC1_INT2IE_POSITION                    0x0000000D
#define _IEC1_INT2IE_MASK                        0x00002000
#define _IEC1_INT2IE_LENGTH                      0x00000001

#define _IEC4_U1ERIE_POSITION                    0x00000001
#define _IEC4_U1ERIE_MASK                        0x00000002
#define _IEC4_U1ERIE_LENGTH                      0x00000001

#define _IEC4_HLVDIE_POSITION                    0x00000008
#define _IEC4_HLVDIE_MASK                        0x00000100
#define _IEC4_HLVDIE_LENGTH                      0x00000001

#define _IEC4_CTMUIE_POSITION                    0x0000000D
#define _IEC4_CTMUIE_MASK                        0x00002000
#define _IEC4_CTMUIE_LENGTH                      0x00000001

#define _IEC5_ULPWUIE_POSITION                   0x00000000
#define _IEC5_ULPWUIE_MASK                       0x00000001
#define _IEC5_ULPWUIE_LENGTH                     0x00000001

#define _IEC6_CLC1IE_POSITION                    0x00000000
#define _IEC6_CLC1IE_MASK                        0x00000001
#define _IEC6_CLC1IE_LENGTH                      0x00000001

#define _IPC0_INT0IP_POSITION                    0x00000000
#define _IPC0_INT0IP_MASK                        0x00000007
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC0_CCP1IP_POSITION                    0x00000004
#define _IPC0_CCP1IP_MASK                        0x00000070
#define _IPC0_CCP1IP_LENGTH                      0x00000003

#define _IPC0_CCP2IP_POSITION                    0x00000008
#define _IPC0_CCP2IP_MASK                        0x00000700
#define _IPC0_CCP2IP_LENGTH                      0x00000003

#define _IPC0_T1IP_POSITION                      0x0000000C
#define _IPC0_T1IP_MASK                          0x00007000
#define _IPC0_T1IP_LENGTH                        0x00000003

#define _IPC0_INT0IP0_POSITION                   0x00000000
#define _IPC0_INT0IP0_MASK                       0x00000001
#define _IPC0_INT0IP0_LENGTH                     0x00000001

#define _IPC0_INT0IP1_POSITION                   0x00000001
#define _IPC0_INT0IP1_MASK                       0x00000002
#define _IPC0_INT0IP1_LENGTH                     0x00000001

#define _IPC0_INT0IP2_POSITION                   0x00000002
#define _IPC0_INT0IP2_MASK                       0x00000004
#define _IPC0_INT0IP2_LENGTH                     0x00000001

#define _IPC0_CC1IP0_POSITION                    0x00000004
#define _IPC0_CC1IP0_MASK                        0x00000010
#define _IPC0_CC1IP0_LENGTH                      0x00000001

#define _IPC0_CC1IP1_POSITION                    0x00000005
#define _IPC0_CC1IP1_MASK                        0x00000020
#define _IPC0_CC1IP1_LENGTH                      0x00000001

#define _IPC0_CC1IP2_POSITION                    0x00000006
#define _IPC0_CC1IP2_MASK                        0x00000040
#define _IPC0_CC1IP2_LENGTH                      0x00000001

#define _IPC0_CC2IP0_POSITION                    0x00000008
#define _IPC0_CC2IP0_MASK                        0x00000100
#define _IPC0_CC2IP0_LENGTH                      0x00000001

#define _IPC0_CC2IP1_POSITION                    0x00000009
#define _IPC0_CC2IP1_MASK                        0x00000200
#define _IPC0_CC2IP1_LENGTH                      0x00000001

#define _IPC0_CC2IP2_POSITION                    0x0000000A
#define _IPC0_CC2IP2_MASK                        0x00000400
#define _IPC0_CC2IP2_LENGTH                      0x00000001

#define _IPC0_T1IP0_POSITION                     0x0000000C
#define _IPC0_T1IP0_MASK                         0x00001000
#define _IPC0_T1IP0_LENGTH                       0x00000001

#define _IPC0_T1IP1_POSITION                     0x0000000D
#define _IPC0_T1IP1_MASK                         0x00002000
#define _IPC0_T1IP1_LENGTH                       0x00000001

#define _IPC0_T1IP2_POSITION                     0x0000000E
#define _IPC0_T1IP2_MASK                         0x00004000
#define _IPC0_T1IP2_LENGTH                       0x00000001

#define _IPC1_CCT1IP_POSITION                    0x0000000C
#define _IPC1_CCT1IP_MASK                        0x00007000
#define _IPC1_CCT1IP_LENGTH                      0x00000003

#define _IPC1_CCT1IP0_POSITION                   0x0000000C
#define _IPC1_CCT1IP0_MASK                       0x00001000
#define _IPC1_CCT1IP0_LENGTH                     0x00000001

#define _IPC1_CCT1IP1_POSITION                   0x0000000D
#define _IPC1_CCT1IP1_MASK                       0x00002000
#define _IPC1_CCT1IP1_LENGTH                     0x00000001

#define _IPC1_CCT1IP2_POSITION                   0x0000000E
#define _IPC1_CCT1IP2_MASK                       0x00004000
#define _IPC1_CCT1IP2_LENGTH                     0x00000001

#define _IPC2_CCT2IP_POSITION                    0x00000000
#define _IPC2_CCT2IP_MASK                        0x00000007
#define _IPC2_CCT2IP_LENGTH                      0x00000003

#define _IPC2_U1RXIP_POSITION                    0x0000000C
#define _IPC2_U1RXIP_MASK                        0x00007000
#define _IPC2_U1RXIP_LENGTH                      0x00000003

#define _IPC2_CCT2IP0_POSITION                   0x00000000
#define _IPC2_CCT2IP0_MASK                       0x00000001
#define _IPC2_CCT2IP0_LENGTH                     0x00000001

#define _IPC2_CCT2IP1_POSITION                   0x00000001
#define _IPC2_CCT2IP1_MASK                       0x00000002
#define _IPC2_CCT2IP1_LENGTH                     0x00000001

#define _IPC2_CCT2IP2_POSITION                   0x00000002
#define _IPC2_CCT2IP2_MASK                       0x00000004
#define _IPC2_CCT2IP2_LENGTH                     0x00000001

#define _IPC2_U1RXIP0_POSITION                   0x0000000C
#define _IPC2_U1RXIP0_MASK                       0x00001000
#define _IPC2_U1RXIP0_LENGTH                     0x00000001

#define _IPC2_U1RXIP1_POSITION                   0x0000000D
#define _IPC2_U1RXIP1_MASK                       0x00002000
#define _IPC2_U1RXIP1_LENGTH                     0x00000001

#define _IPC2_U1RXIP2_POSITION                   0x0000000E
#define _IPC2_U1RXIP2_MASK                       0x00004000
#define _IPC2_U1RXIP2_LENGTH                     0x00000001

#define _IPC3_U1TXIP_POSITION                    0x00000000
#define _IPC3_U1TXIP_MASK                        0x00000007
#define _IPC3_U1TXIP_LENGTH                      0x00000003

#define _IPC3_AD1IP_POSITION                     0x00000004
#define _IPC3_AD1IP_MASK                         0x00000070
#define _IPC3_AD1IP_LENGTH                       0x00000003

#define _IPC3_NVMIP_POSITION                     0x0000000C
#define _IPC3_NVMIP_MASK                         0x00007000
#define _IPC3_NVMIP_LENGTH                       0x00000003

#define _IPC3_U1TXIP0_POSITION                   0x00000000
#define _IPC3_U1TXIP0_MASK                       0x00000001
#define _IPC3_U1TXIP0_LENGTH                     0x00000001

#define _IPC3_U1TXIP1_POSITION                   0x00000001
#define _IPC3_U1TXIP1_MASK                       0x00000002
#define _IPC3_U1TXIP1_LENGTH                     0x00000001

#define _IPC3_U1TXIP2_POSITION                   0x00000002
#define _IPC3_U1TXIP2_MASK                       0x00000004
#define _IPC3_U1TXIP2_LENGTH                     0x00000001

